espressif/esp-idf/components/soc/esp32c5/register/soc/ledc_reg.h
#define LEDC_CH5_GAMMA_RANGE10_REG  (DR_REG_LEDC_BASE + 0x568)
/* LEDC_CH5_GAMMA_RANGE10_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH5_GAMMA_RANGE10_DUTY_NUM    0x000003FF
#define LEDC_CH5_GAMMA_RANGE10_DUTY_NUM_M  ((LEDC_CH5_GAMMA_RANGE10_DUTY_NUM_V)<<(LEDC_CH5_GAMMA_RANGE10_DUTY_NUM_S))
#define LEDC_CH5_GAMMA_RANGE10_DUTY_NUM_V  0x3FF
#define LEDC_CH5_GAMMA_RANGE10_DUTY_NUM_S  21
/* LEDC_CH5_GAMMA_RANGE10_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH5_GAMMA_RANGE10_SCALE    0x000003FF
#define LEDC_CH5_GAMMA_RANGE10_SCALE_M  ((LEDC_CH5_GAMMA_RANGE10_SCALE_V)<<(LEDC_CH5_GAMMA_RANGE10_SCALE_S))
#define LEDC_CH5_GAMMA_RANGE10_SCALE_V  0x3FF
#define LEDC_CH5_GAMMA_RANGE10_SCALE_S  11
/* LEDC_CH5_GAMMA_RANGE10_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH5_GAMMA_RANGE10_DUTY_CYCLE    0x000003FF
#define LEDC_CH5_GAMMA_RANGE10_DUTY_CYCLE_M  ((LEDC_CH5_GAMMA_RANGE10_DUTY_CYCLE_V)<<(LEDC_CH5_GAMMA_RANGE10_DUTY_CYCLE_S))
#define LEDC_CH5_GAMMA_RANGE10_DUTY_CYCLE_V  0x3FF
#define LEDC_CH5_GAMMA_RANGE10_DUTY_CYCLE_S  1
/* LEDC_CH5_GAMMA_RANGE10_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH5_GAMMA_RANGE10_DUTY_INC    (BIT(0))
#define LEDC_CH5_GAMMA_RANGE10_DUTY_INC_M  (BIT(0))
#define LEDC_CH5_GAMMA_RANGE10_DUTY_INC_V  0x1
#define LEDC_CH5_GAMMA_RANGE10_DUTY_INC_S  0

#define LEDC_CH5_GAMMA_RANGE11_REG  (DR_REG_LEDC_BASE + 0x56c)
/* LEDC_CH5_GAMMA_RANGE11_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH5_GAMMA_RANGE11_DUTY_NUM    0x000003FF
#define LEDC_CH5_GAMMA_RANGE11_DUTY_NUM_M  ((LEDC_CH5_GAMMA_RANGE11_DUTY_NUM_V)<<(LEDC_CH5_GAMMA_RANGE11_DUTY_NUM_S))
#define LEDC_CH5_GAMMA_RANGE11_DUTY_NUM_V  0x3FF
#define LEDC_CH5_GAMMA_RANGE11_DUTY_NUM_S  21
/* LEDC_CH5_GAMMA_RANGE11_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH5_GAMMA_RANGE11_SCALE    0x000003FF
#define LEDC_CH5_GAMMA_RANGE11_SCALE_M  ((LEDC_CH5_GAMMA_RANGE11_SCALE_V)<<(LEDC_CH5_GAMMA_RANGE11_SCALE_S))
#define LEDC_CH5_GAMMA_RANGE11_SCALE_V  0x3FF
#define LEDC_CH5_GAMMA_RANGE11_SCALE_S  11
/* LEDC_CH5_GAMMA_RANGE11_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH5_GAMMA_RANGE11_DUTY_CYCLE    0x000003FF
#define LEDC_CH5_GAMMA_RANGE11_DUTY_CYCLE_M  ((LEDC_CH5_GAMMA_RANGE11_DUTY_CYCLE_V)<<(LEDC_CH5_GAMMA_RANGE11_DUTY_CYCLE_S))
#define LEDC_CH5_GAMMA_RANGE11_DUTY_CYCLE_V  0x3FF
#define LEDC_CH5_GAMMA_RANGE11_DUTY_CYCLE_S  1
/* LEDC_CH5_GAMMA_RANGE11_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH5_GAMMA_RANGE11_DUTY_INC    (BIT(0))
#define LEDC_CH5_GAMMA_RANGE11_DUTY_INC_M  (BIT(0))
#define LEDC_CH5_GAMMA_RANGE11_DUTY_INC_V  0x1
#define LEDC_CH5_GAMMA_RANGE11_DUTY_INC_S  0

#define LEDC_CH5_GAMMA_RANGE12_REG  (DR_REG_LEDC_BASE + 0x570)
/* LEDC_CH5_GAMMA_RANGE12_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH5_GAMMA_RANGE12_DUTY_NUM    0x000003FF
#define LEDC_CH5_GAMMA_RANGE12_DUTY_NUM_M  ((LEDC_CH5_GAMMA_RANGE12_DUTY_NUM_V)<<(LEDC_CH5_GAMMA_RANGE12_DUTY_NUM_S))
#define LEDC_CH5_GAMMA_RANGE12_DUTY_NUM_V  0x3FF
#define LEDC_CH5_GAMMA_RANGE12_DUTY_NUM_S  21
/* LEDC_CH5_GAMMA_RANGE12_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH5_GAMMA_RANGE12_SCALE    0x000003FF
#define LEDC_CH5_GAMMA_RANGE12_SCALE_M  ((LEDC_CH5_GAMMA_RANGE12_SCALE_V)<<(LEDC_CH5_GAMMA_RANGE12_SCALE_S))
#define LEDC_CH5_GAMMA_RANGE12_SCALE_V  0x3FF
#define LEDC_CH5_GAMMA_RANGE12_SCALE_S  11
/* LEDC_CH5_GAMMA_RANGE12_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH5_GAMMA_RANGE12_DUTY_CYCLE    0x000003FF
#define LEDC_CH5_GAMMA_RANGE12_DUTY_CYCLE_M  ((LEDC_CH5_GAMMA_RANGE12_DUTY_CYCLE_V)<<(LEDC_CH5_GAMMA_RANGE12_DUTY_CYCLE_S))
#define LEDC_CH5_GAMMA_RANGE12_DUTY_CYCLE_V  0x3FF
#define LEDC_CH5_GAMMA_RANGE12_DUTY_CYCLE_S  1
/* LEDC_CH5_GAMMA_RANGE12_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH5_GAMMA_RANGE12_DUTY_INC    (BIT(0))
#define LEDC_CH5_GAMMA_RANGE12_DUTY_INC_M  (BIT(0))
#define LEDC_CH5_GAMMA_RANGE12_DUTY_INC_V  0x1
#define LEDC_CH5_GAMMA_RANGE12_DUTY_INC_S  0

#define LEDC_CH5_GAMMA_RANGE13_REG  (DR_REG_LEDC_BASE + 0x574)
/* LEDC_CH5_GAMMA_RANGE13_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH5_GAMMA_RANGE13_DUTY_NUM    0x000003FF
#define LEDC_CH5_GAMMA_RANGE13_DUTY_NUM_M  ((LEDC_CH5_GAMMA_RANGE13_DUTY_NUM_V)<<(LEDC_CH5_GAMMA_RANGE13_DUTY_NUM_S))
#define LEDC_CH5_GAMMA_RANGE13_DUTY_NUM_V  0x3FF
#define LEDC_CH5_GAMMA_RANGE13_DUTY_NUM_S  21
/* LEDC_CH5_GAMMA_RANGE13_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH5_GAMMA_RANGE13_SCALE    0x000003FF
#define LEDC_CH5_GAMMA_RANGE13_SCALE_M  ((LEDC_CH5_GAMMA_RANGE13_SCALE_V)<<(LEDC_CH5_GAMMA_RANGE13_SCALE_S))
#define LEDC_CH5_GAMMA_RANGE13_SCALE_V  0x3FF
#define LEDC_CH5_GAMMA_RANGE13_SCALE_S  11
/* LEDC_CH5_GAMMA_RANGE13_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH5_GAMMA_RANGE13_DUTY_CYCLE    0x000003FF
#define LEDC_CH5_GAMMA_RANGE13_DUTY_CYCLE_M  ((LEDC_CH5_GAMMA_RANGE13_DUTY_CYCLE_V)<<(LEDC_CH5_GAMMA_RANGE13_DUTY_CYCLE_S))
#define LEDC_CH5_GAMMA_RANGE13_DUTY_CYCLE_V  0x3FF
#define LEDC_CH5_GAMMA_RANGE13_DUTY_CYCLE_S  1
/* LEDC_CH5_GAMMA_RANGE13_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH5_GAMMA_RANGE13_DUTY_INC    (BIT(0))
#define LEDC_CH5_GAMMA_RANGE13_DUTY_INC_M  (BIT(0))
#define LEDC_CH5_GAMMA_RANGE13_DUTY_INC_V  0x1
#define LEDC_CH5_GAMMA_RANGE13_DUTY_INC_S  0

#define LEDC_CH5_GAMMA_RANGE14_REG  (DR_REG_LEDC_BASE + 0x578)
/* LEDC_CH5_GAMMA_RANGE14_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH5_GAMMA_RANGE14_DUTY_NUM    0x000003FF
#define LEDC_CH5_GAMMA_RANGE14_DUTY_NUM_M  ((LEDC_CH5_GAMMA_RANGE14_DUTY_NUM_V)<<(LEDC_CH5_GAMMA_RANGE14_DUTY_NUM_S))
#define LEDC_CH5_GAMMA_RANGE14_DUTY_NUM_V  0x3FF
#define LEDC_CH5_GAMMA_RANGE14_DUTY_NUM_S  21
/* LEDC_CH5_GAMMA_RANGE14_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH5_GAMMA_RANGE14_SCALE    0x000003FF
#define LEDC_CH5_GAMMA_RANGE14_SCALE_M  ((LEDC_CH5_GAMMA_RANGE14_SCALE_V)<<(LEDC_CH5_GAMMA_RANGE14_SCALE_S))
#define LEDC_CH5_GAMMA_RANGE14_SCALE_V  0x3FF
#define LEDC_CH5_GAMMA_RANGE14_SCALE_S  11
/* LEDC_CH5_GAMMA_RANGE14_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH5_GAMMA_RANGE14_DUTY_CYCLE    0x000003FF
#define LEDC_CH5_GAMMA_RANGE14_DUTY_CYCLE_M  ((LEDC_CH5_GAMMA_RANGE14_DUTY_CYCLE_V)<<(LEDC_CH5_GAMMA_RANGE14_DUTY_CYCLE_S))
#define LEDC_CH5_GAMMA_RANGE14_DUTY_CYCLE_V  0x3FF
#define LEDC_CH5_GAMMA_RANGE14_DUTY_CYCLE_S  1
/* LEDC_CH5_GAMMA_RANGE14_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH5_GAMMA_RANGE14_DUTY_INC    (BIT(0))
#define LEDC_CH5_GAMMA_RANGE14_DUTY_INC_M  (BIT(0))
#define LEDC_CH5_GAMMA_RANGE14_DUTY_INC_V  0x1
#define LEDC_CH5_GAMMA_RANGE14_DUTY_INC_S  0

#define LEDC_CH5_GAMMA_RANGE15_REG  (DR_REG_LEDC_BASE + 0x57c)
/* LEDC_CH5_GAMMA_RANGE15_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH5_GAMMA_RANGE15_DUTY_NUM    0x000003FF
#define LEDC_CH5_GAMMA_RANGE15_DUTY_NUM_M  ((LEDC_CH5_GAMMA_RANGE15_DUTY_NUM_V)<<(LEDC_CH5_GAMMA_RANGE15_DUTY_NUM_S))
#define LEDC_CH5_GAMMA_RANGE15_DUTY_NUM_V  0x3FF
#define LEDC_CH5_GAMMA_RANGE15_DUTY_NUM_S  21
/* LEDC_CH5_GAMMA_RANGE15_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH5_GAMMA_RANGE15_SCALE    0x000003FF
#define LEDC_CH5_GAMMA_RANGE15_SCALE_M  ((LEDC_CH5_GAMMA_RANGE15_SCALE_V)<<(LEDC_CH5_GAMMA_RANGE15_SCALE_S))
#define LEDC_CH5_GAMMA_RANGE15_SCALE_V  0x3FF
#define LEDC_CH5_GAMMA_RANGE15_SCALE_S  11
/* LEDC_CH5_GAMMA_RANGE15_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH5_GAMMA_RANGE15_DUTY_CYCLE    0x000003FF
#define LEDC_CH5_GAMMA_RANGE15_DUTY_CYCLE_M  ((LEDC_CH5_GAMMA_RANGE15_DUTY_CYCLE_V)<<(LEDC_CH5_GAMMA_RANGE15_DUTY_CYCLE_S))
#define LEDC_CH5_GAMMA_RANGE15_DUTY_CYCLE_V  0x3FF
#define LEDC_CH5_GAMMA_RANGE15_DUTY_CYCLE_S  1
/* LEDC_CH5_GAMMA_RANGE15_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH5_GAMMA_RANGE15_DUTY_INC    (BIT(0))
#define LEDC_CH5_GAMMA_RANGE15_DUTY_INC_M  (BIT(0))
#define LEDC_CH5_GAMMA_RANGE15_DUTY_INC_V  0x1
#define LEDC_CH5_GAMMA_RANGE15_DUTY_INC_S  0

#ifdef __cplusplus
}
#endif
